{
  "es": {
    "header": {
      "name": "SANTIAGO SANCHEZ"
    },
    "about": {
      "title": "Sobre mí",
      "text": "Soy un desarrollador web apasionado, siempre en busca de nuevos retos. Me encanta aprender, innovar y transformar ideas en soluciones digitales efectivas."
    },
    "Contact": "CONTACTO",
    "TituleProyects": "Proyectos",
    "ContactMe": "Contáctame",
    "Enviar": "Enviar",
    "Cards": {
      "Cards1": {
        "title": "Simulador ARM",
        "text": "Soy un desarrollador apasionado, siempre en busca de nuevos desafíos. Me encanta aprender, crear innovaciones digitales y transformar ideas en soluciones creativas y funcionales, dígito a dígito y código a código.",
        "image": "/assets/Proyects/ARM.webp",
        "link": "https://github.com/Sanchez-Santiago/Simulador-ARM-",
        "technology": "Rust"
      },
      "Cards2": {
        "title": "Juego de la Vida",
        "text": "Implementación interactiva del famoso Juego de la Vida de Conway, desarrollada en Java. Permite a los usuarios diseñar sus propios patrones, generar configuraciones aleatorias y controlar la simulación con opciones para iniciar, pausar y reiniciar el proceso. Una experiencia visual fascinante de autómatas celulares en acción.",
        "image": "/assets/Proyects/Juego_De_La_Vida.webp",
        "link": "https://github.com/Sanchez-Santiago/Juago-De-La-Vida",
        "technology": "Java"
      },
      "Cards3": {
        "title": "San Valentin",
        "text": "Página web interactiva diseñada para invitar a alguien a ser mi San Valentín, con un diseño atractivo y una experiencia personalizada para hacer la propuesta aún más especial.",
        "image": "/assets/Proyects/San_Valentin.webp",
        "link": "https://san-valentin-ss.netlify.app/",
        "technology": "React"
      },
      "Cards4": {
        "title": "Me Perdonas",
        "text": "Un sitio web diseñado para aquellos momentos en los que necesitas disculparte de una forma original y creativa. Con mensajes personalizados, efectos visuales románticos y hasta un botón de 'perdóname' que no se puede ignorar. Perfecta para calmar cualquier tormenta emocional y recuperar la paz en tu relación.",
        "image": "/assets/Proyects/Me_Perdonas.webp",
        "link": "https://me-perdonas-porfa.netlify.app/",
        "technology": "Astro"
      }
    },
    "phrases": [
      "Apasionado por la tecnología",
      "Cada línea de código cuenta",
      "Construyendo el futuro, un pixel a la vez",
      "El código es mi lienzo",
      "Innovar para transformar",
      "Conectando ideas con tecnología",
      "Transformando desafíos en soluciones"
    ]
  },

  "en": {
    "header": {
      "name": "SANTIAGO SANCHEZ"
    },
    "about": {
      "title": "About me",
      "text": "I am a passionate developer, always seeking new challenges. I love learning, creating digital innovations, and transforming ideas into creative and functional solutions, digit by digit and code by code."
    },
    "Contact": "CONTACT",
    "TituleProyects": "Projects",
    "ContactMe": "Contact Me",
    "Enviar": "Send",
    "Cards": {
      "Cards1": {
        "title": "ARM Simulator",
        "text": "An emulator for the ARM architecture, developed in Rust. This project allows users to execute ARM assembly code in a controlled environment, visualizing memory states and register values. A powerful tool for understanding low-level computer architecture and assembly programming.",
        "image": "/assets/Proyects/ARM.webp",
        "link": "https://github.com/Sanchez-Santiago/Simulador-ARM-",
        "technology": "Rust"
      },
      "Cards2": {
        "title": "Game of Life",
        "text": "Interactive implementation of Conway's famous Game of Life, developed in Java. It allows users to design their own patterns, generate random configurations, and control the simulation with options to start, pause, and restart the process. A fascinating visual experience of cellular automata in action.",
        "image": "/assets/Proyects/Juego_De_La_Vida.webp",
        "link": "https://github.com/Sanchez-Santiago/Juago-De-La-Vida",
        "technology": "Java"
      },
      "Cards3": {
        "title": "Valentine's Day",
        "text": "Interactive webpage designed to invite someone to be my Valentine, with an attractive design and a personalized experience to make the proposal even more special.",
        "image": "/assets/Proyects/San_Valentin.webp",
        "link": "https://san-valentin-ss.netlify.app/",
        "technology": "React"
      },
      "Cards4": {
        "title": "Forgive Me",
        "text": "A website designed for those moments when you need to apologize in an original and creative way. With personalized messages, romantic visual effects, and even a 'forgive me' button that can't be ignored. Perfect for calming any emotional storm and restoring peace in your relationship.",
        "image": "/assets/Proyects/Me_Perdonas.webp",
        "link": "https://me-perdonas-porfa.netlify.app/",
        "technology": "Astro"
      }
    },
    "phrases": [
      "Passionate about technology",
      "Every line of code matters",
      "Building the future, one pixel at a time",
      "Code is my canvas",
      "Innovate to transform",
      "Connecting ideas with technology",
      "Turning challenges into solutions"
    ]
  }
}